Revit 2024 API
TessellatedShapeBuilder.OwnerInfo Property
 String used for logging, if any. Usually describes the element or object, which either defined or will own the geoemtrical objects to be built.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string OwnerInfo { get; set; }
Visual Basic
Public Property OwnerInfo As String
	Get
	Set
Visual C++
public:
property String^ OwnerInfo {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace